___
#    <font color=red>$PROGETTO$  $COMPUTER$  $SCIENCE$ </font>


_Hamza_  _Jabrane_

_Matricola:_ _833690_
___

1. For each movie, compute the number of cast members.  

* How many movies do not have a homepage?  

* For each year, how many movies do not have a homepage?  

* Extract the domain of each homepage.  

* Extract a set of normalized tables. That is, each entry of a normalized table must contain exactly one 
value (not a list or a dictionary - . There is no need to use SQL for this point.  

* For each movie, compute the gross margin (difference between revenue and budget).  

* For each movie, compute the number of crew members.  

* For each movie, compute the number of directors.  

* For each language, compute the number of movies where such language is spoken.  

* For each company and each decade, compute the overall revenue.  

* For each decade, compute the company with maximum revenue.

* In each year, how many movies have revenue smaller than the budget?

In [1]:
import numpy as np
import pandas as pd
import tldextract
import json

In [2]:
credits = pd.read_csv("C:/Users/hp/Desktop/LAUREA MAGISTRALE/I Semestre/Computer Science/Progetto/Dataset/movies/tmdb_5000_credits.csv")
movies = pd.read_csv("C:/Users/hp/Desktop/LAUREA MAGISTRALE/I Semestre/Computer Science/Progetto/Dataset/movies/tmdb_5000_movies.csv")

Essendo "id" della tabella movies coincidente a "movie_id" della tabella credits, uso questa colonna per unire successivamente le due tabelle.

In [3]:
movies.rename(columns={'id': 'movie_id'}, inplace=True)

In [4]:
overall=pd.merge(movies,credits,on='movie_id')
overall.head(3)

,budget,genres,homepage,movie_id,keywords,original_language,original_title,overview,popularity,production_companies,...,runtime,spoken_languages,status,tagline,title_x,vote_average,vote_count,title_y,cast,crew
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...",...,162.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Enter the World of Pandora.,Avatar,7.2,11800,Avatar,"[{""cast_id"": 242, ""character"": ""Jake Sully"", ""...","[{""credit_id"": ""52fe48009251416c750aca23"", ""de..."
1,300000000,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 14, ""...",http://disney.go.com/disneypictures/pirates/,285,"[{""id"": 270, ""name"": ""ocean""}, {""id"": 726, ""na...",en,Pirates of the Caribbean: At World's End,"Captain Barbossa, long believed to be dead, ha...",139.082615,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}, {""...",...,169.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,"At the end of the world, the adventure begins.",Pirates of the Caribbean: At World's End,6.9,4500,Pirates of the Caribbean: At World's End,"[{""cast_id"": 4, ""character"": ""Captain Jack Spa...","[{""credit_id"": ""52fe4232c3a36847f800b579"", ""de..."
2,245000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.sonypictures.com/movies/spectre/,206647,"[{""id"": 470, ""name"": ""spy""}, {""id"": 818, ""name...",en,Spectre,A cryptic message from Bond’s past sends him o...,107.376788,"[{""name"": ""Columbia Pictures"", ""id"": 5}, {""nam...",...,148.0,"[{""iso_639_1"": ""fr"", ""name"": ""Fran\u00e7ais""},...",Released,A Plan No One Escapes,Spectre,6.3,4466,Spectre,"[{""cast_id"": 1, ""character"": ""James Bond"", ""cr...","[{""credit_id"": ""54805967c3a36829b5002c41"", ""de..."

#### 1. For each movie, compute the number of cast members.

In [5]:
cast=overall['cast'].apply(pd.read_json)
cast[0].groupby("cast_id").size().count()

83

La funzione precedente era utilizzata per il conteggio di una singola riga, mentre per iterarla per tuttle le singole righe si definisce una funzione **"conta_cast"**.

In [6]:
def conta_cast(row):
    try:
        conta = pd.read_json(row).groupby('cast_id').size().count()
    except:
        conta = 0
    return conta

In [7]:
overall['membri_cast'] = overall['cast'].apply(conta_cast)
overall[["movie_id","original_title","membri_cast"]].head(3)

   movie_id                            original_title  membri_cast
0     19995                                    Avatar           83
1       285  Pirates of the Caribbean: At World's End           34
2    206647                                   Spectre           83

In [8]:
#Secondo metodo
overall["membri_cast2"]=overall.cast.apply(lambda x: len(json.loads(x)))
overall[["movie_id","original_title","membri_cast2"]].head(3)

   movie_id                            original_title  membri_cast2
0     19995                                    Avatar            83
1       285  Pirates of the Caribbean: At World's End            34
2    206647                                   Spectre            83

#### 2. How many movies do not have a homepage?

In [9]:
film_no_homepage=movies.homepage.isnull().sum()
film_no_homepage

3091

#### 3. For each year, how many movies do not have a homepage?

In [10]:
#Trasformazione in valori temporali completi.
overall['release_date'] = pd.to_datetime(movies['release_date']) 
#Considerare solo l'anno.
overall['anno_uscita'] = overall['release_date'].dt.year 
#Tabella con anni convertiti.
overall[["movie_id","original_title","homepage","release_date","anno_uscita"]].tail(3)

,movie_id,original_title,homepage,release_date,anno_uscita
4800,231617,"Signed, Sealed, Delivered",http://www.hallmarkchannel.com/signedsealeddel...,2013-10-13,2013.0
4801,126186,Shanghai Calling,http://shanghaicalling.com/,2012-05-03,2012.0
4802,25975,My Date with Drew,NaN,2005-08-05,2005.0

In [11]:
film_per_data=overall[overall.homepage.isnull()].groupby(['anno_uscita'],as_index=True)
film_per_data.agg({'homepage': sum, 'anno_uscita': 'count'}).tail()

             homepage  anno_uscita
anno_uscita
2012.0            NaN           92
2013.0            NaN          127
2014.0            NaN          157
2015.0            NaN          110
2016.0            NaN           31

#### 4. Extract the domain of each homepage.

Controllo della funzione tldextract.extract a livello di riga.

In [12]:
tldextract.extract(overall.homepage[54]).domain 
#Estraggo il dominio di "The Good Dinosaur" della Disney come prova.

'disney'

Genero funzione che estragga a livello di dataframe.

In [13]:
def estrai_dominio (url):
    try :
        dominio = tldextract.extract(url).domain
    except:
        dominio = ""
    return dominio

In [14]:
overall["domain"]=movies["homepage"].apply(estrai_dominio)
overall["domain"].isnull().sum() #controllo se per caso ha generato Nan

0

In [15]:
(overall[["movie_id","original_title","domain"]])[51:55]

,movie_id,original_title,domain
51,68726,Pacific Rim,pacificrimmovie
52,38356,Transformers: Dark of the Moon,transformersmovie
53,217,Indiana Jones and the Kingdom of the Crystal S...,indianajones
54,105864,The Good Dinosaur,disney

#### 5. Extract a set of normalized tables. That is, each entry of a normalized table must contain exactly one value (not a list or a dictionary). There is no need to use SQL for this point.

Creare delle tabelle normalizzate delle colonne in json, le colonne da cui estrarre le tabelle normalizzate sono:

___

* "cast" 
* "generes" 
* "production_companies"
* "keywords"
* "crew"
* "lingua_parlata"

In [16]:
def trasforma_in_tabella(overall,json_to_column,column_id): #definire gli input della funzione
    tabella=pd.DataFrame() #la tabella deve essere un dataframe
    for i in range(len(overall)): #ciclo for
        estrai = pd.read_json(overall[json_to_column][i]) #si estraggono i dati dalle righe json
        estrai["movies_id"] = overall[column_id][i] #nome colonna
        tabella=pd.concat([tabella,estrai]) #tabella(righe,colonne)
    return tabella

In [17]:
tabella_cast = trasforma_in_tabella(overall,"cast","movie_id",) #tabella normalizzata "cast"

In [18]:
tabella_cast.rename(columns={"id": "cast_id"}, inplace=True)
tabella_cast.head()

,cast_id,character,credit_id,gender,cast_id,movies_id,name,order
0.0,242.0,Jake Sully,5602a8a7c3a3685532001c9a,2.0,65731.0,19995,Sam Worthington,0.0
1.0,3.0,Neytiri,52fe48009251416c750ac9cb,1.0,8691.0,19995,Zoe Saldana,1.0
2.0,25.0,Dr. Grace Augustine,52fe48009251416c750aca39,1.0,10205.0,19995,Sigourney Weaver,2.0
3.0,4.0,Col. Quaritch,52fe48009251416c750ac9cf,2.0,32747.0,19995,Stephen Lang,3.0
4.0,5.0,Trudy Chacon,52fe48009251416c750ac9d3,1.0,17647.0,19995,Michelle Rodriguez,4.0

In [19]:
tabella_genere =trasforma_in_tabella(overall,"genres","movie_id") #tabella normalizzata generi
tabella_genere.rename(columns={"id": "genres_id"}, inplace=True)
tabella_genere.head()

     genres_id  movies_id             name
0.0       28.0      19995           Action
1.0       12.0      19995        Adventure
2.0       14.0      19995          Fantasy
3.0      878.0      19995  Science Fiction
0.0       12.0        285        Adventure

In [20]:
tabella_production_companies=trasforma_in_tabella(overall,"production_companies","movie_id")
#tabella normalizzata production_companies
tabella_production_companies.rename(columns={"id": "company_id"}, inplace=True)
tabella_production_companies.head()

     company_id  movies_id                                    name
0.0       289.0      19995                 Ingenious Film Partners
1.0       306.0      19995  Twentieth Century Fox Film Corporation
2.0       444.0      19995                      Dune Entertainment
3.0       574.0      19995                Lightstorm Entertainment
0.0         2.0        285                    Walt Disney Pictures

In [21]:
tabella_keywords=trasforma_in_tabella(overall,"keywords","movie_id")
tabella_keywords.rename(columns={"id": "keywords_id"}, inplace=True)
tabella_keywords.head() #tabella normalizzata keywords

     keywords_id  movies_id           name
0.0       1463.0      19995  culture clash
1.0       2964.0      19995         future
2.0       3386.0      19995      space war
3.0       3388.0      19995   space colony
4.0       3679.0      19995        society

In [22]:
tabella_crew=trasforma_in_tabella(credits,"crew","movie_id")
tabella_crew.rename(columns={"id": "id_persona"}, inplace=True)
tabella_crew.head() #tabella normalizzata crew

,credit_id,department,gender,id_persona,job,movies_id,name
0.0,52fe48009251416c750aca23,Editing,0.0,1721.0,Editor,19995,Stephen E. Rivkin
1.0,539c47ecc3a36810e3001f87,Art,2.0,496.0,Production Design,19995,Rick Carter
2.0,54491c89c3a3680fb4001cf7,Sound,0.0,900.0,Sound Designer,19995,Christopher Boyes
3.0,54491cb70e0a267480001bd0,Sound,0.0,900.0,Supervising Sound Editor,19995,Christopher Boyes
4.0,539c4a4cc3a36810c9002101,Production,1.0,1262.0,Casting,19995,Mali Finn

In [23]:
tabella_lingua=trasforma_in_tabella(overall,"spoken_languages","movie_id")
tabella_lingua.head() #tabella normalizzata lingua

    iso_639_1  movies_id      name
0.0        en      19995   English
1.0        es      19995   Español
0.0        en        285   English
0.0        fr     206647  Français
1.0        en     206647   English

#### 6. For each movie, compute the gross margin (difference between revenue and budget).

In [24]:
overall["margin"]=overall["revenue"]-overall["budget"]
(overall[["movie_id","original_title","revenue","budget","margin"]]).head(5)

,movie_id,original_title,revenue,budget,margin
0,19995,Avatar,2787965087,237000000,2550965087
1,285,Pirates of the Caribbean: At World's End,961000000,300000000,661000000
2,206647,Spectre,880674609,245000000,635674609
3,49026,The Dark Knight Rises,1084939099,250000000,834939099
4,49529,John Carter,284139100,260000000,24139100

#### 7. For each movie, compute the number of crew members.

In [25]:
def membri_crew(row):
    try:
        conta_membri_crew = pd.read_json(row).groupby("credit_id").size().count()
    except:
        conta_membri_crew = 0
    return conta_membri_crew

In [26]:
overall["membri_crew"] = overall["crew"].apply(membri_crew)
overall[["movie_id","original_title","membri_crew"]].head(3)

   movie_id                            original_title  membri_crew
0     19995                                    Avatar          153
1       285  Pirates of the Caribbean: At World's End           32
2    206647                                   Spectre          155

#### 8. For each movie, compute the number of directors.

Per trovare il numero dei direttori si osserva la **lunghezza del vettore "dir"** attraverso la funzione "len" tenendo conto però che "job" deve essere uguale a "Director".

In [27]:
overall["crew"]=overall.crew.apply(json.loads)
overall["num_direttori"]=overall.crew.apply(lambda membri_crew: 
                                  len([dir for dir in membri_crew if dir["job"]=="Director"]))
overall[["num_direttori","movie_id"]].groupby("num_direttori").count() #quanti film hanno x direttori

               movie_id
num_direttori
0                    30
1                  4465
2                   277
3                    21
4                     3
6                     2
7                     1
8                     1
12                    2
21                    1

In [28]:
overall[["movie_id","original_title","num_direttori"]].head(3)

   movie_id                            original_title  num_direttori
0     19995                                    Avatar              1
1       285  Pirates of the Caribbean: At World's End              1
2    206647                                   Spectre              1

#### 9. For each language, compute the number of movies where such language is spoken.

In [29]:
tabella_lingua.head()

    iso_639_1  movies_id      name
0.0        en      19995   English
1.0        es      19995   Español
0.0        en        285   English
0.0        fr     206647  Français
1.0        en     206647   English

In [30]:
film_per_lingua=tabella_lingua.groupby("name",).count()
film_per_lingua.drop(["??????",""],axis=0,inplace=True)
film_per_lingua.drop("iso_639_1", axis=1,inplace=True)
film_per_lingua[14:20]

           movies_id
name
Galego             1
Hrvatski           4
Italiano         188
Kiswahili          8
Latin             52
Magyar            42

#### 10. For each company and each decade, compute the overall revenue.

In [31]:
ricavi_per_azienda=pd.merge(movies[["movie_id","original_title","revenue"]],
                                     tabella_production_companies.groupby("movies_id")[["name"]].count(),
                                     left_on="movie_id",right_index = True,how="right")

In [32]:
ricavi_per_azienda.head(3)

   movie_id                            original_title     revenue  name
0     19995                                    Avatar  2787965087     4
1       285  Pirates of the Caribbean: At World's End   961000000     3
2    206647                                   Spectre   880674609     3

In [33]:
pd.options.display.float_format = '{:,.2f}'.format  #notazione scientifica
#Trovare i ricavi a livello di azienda e non per film
ricavi_per_azienda["revenue/company"]=ricavi_per_azienda["revenue"]/ricavi_per_azienda["name"]
#colonna revenue/company nel dataframe principale
overall["revenue/company"]=ricavi_per_azienda["revenue/company"]
overall[['revenue','movie_id','production_companies','revenue/company']].head() #tabella con info

,revenue,movie_id,production_companies,revenue/company
0,2787965087,19995,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...","696,991,271.75"
1,961000000,285,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}, {""...","320,333,333.33"
2,880674609,206647,"[{""name"": ""Columbia Pictures"", ""id"": 5}, {""nam...","293,558,203.00"
3,1084939099,49026,"[{""name"": ""Legendary Pictures"", ""id"": 923}, {""...","271,234,774.75"
4,284139100,49529,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}]","284,139,100.00"

In [34]:
#right join dei dataframe overall e tabella_production_companies per avere i ricavi e le info su film e az.
azienda_ricavi_nomi=pd.merge(overall[
    ['movie_id','original_title','anno_uscita','revenue/company','release_date']],
                                     tabella_production_companies,
                                     left_on='movie_id',
                                     right_on = 'movies_id',
                                     how='right')

In [35]:
azienda_ricavi_nomi.head()

,movie_id,original_title,anno_uscita,revenue/company,release_date,company_id,movies_id,name
0,19995,Avatar,"2,009.00","696,991,271.75",2009-12-10,289.00,19995,Ingenious Film Partners
1,19995,Avatar,"2,009.00","696,991,271.75",2009-12-10,306.00,19995,Twentieth Century Fox Film Corporation
2,19995,Avatar,"2,009.00","696,991,271.75",2009-12-10,444.00,19995,Dune Entertainment
3,19995,Avatar,"2,009.00","696,991,271.75",2009-12-10,574.00,19995,Lightstorm Entertainment
4,285,Pirates of the Caribbean: At World's End,"2,007.00","320,333,333.33",2007-05-19,2.00,285,Walt Disney Pictures

In [36]:
pd.options.display.float_format = '{:,.2f}'.format  #notazione scientifica
ricavi_per_decennio=(azienda_ricavi_nomi.groupby(['name',pd.cut(azienda_ricavi_nomi['anno_uscita'], #crea intervallo
      np.arange(azienda_ricavi_nomi['anno_uscita'].min(), #creazione colonna decennio [lim unf]
          azienda_ricavi_nomi['anno_uscita'].max()+1, 10))] #creazione colonna decennio [lim sup]
                           ).agg({'revenue/company':'sum'}).sort_values(['revenue/company'],ascending=False)) #groupby a liv di dataframe
ricavi_per_decennio.head()

                                       revenue/company
name                 anno_uscita
Walt Disney Pictures (2006.0, 2016.0] 7,546,685,802.75
DreamWorks Animation (2006.0, 2016.0] 7,000,321,157.08
Marvel Studios       (2006.0, 2016.0] 6,816,261,805.75
Columbia Pictures    (2006.0, 2016.0] 6,712,364,583.49
Warner Bros.         (2006.0, 2016.0] 6,081,728,447.01

#### 11. For each decade, compute the company with maximum revenue.

In [37]:
max_decennio=pd.DataFrame(ricavi_per_decennio.pivot_table(index='name',
                                                          columns=['anno_uscita'],aggfunc=sum).idxmax())
max_decennio.rename(columns={max_decennio.columns[0]:"Aziende produttrici di film"}).head(10)

                                             Aziende produttrici di film
                anno_uscita
revenue/company (1916.0, 1926.0]               Metro-Goldwyn-Mayer (MGM)
                (1926.0, 1936.0]                       The Caddo Company
                (1936.0, 1946.0]                 Walt Disney Productions
                (1946.0, 1956.0]  Twentieth Century Fox Film Corporation
                (1956.0, 1966.0]               Metro-Goldwyn-Mayer (MGM)
                (1966.0, 1976.0]                      Universal Pictures
                (1976.0, 1986.0]                      Paramount Pictures
                (1986.0, 1996.0]                      Paramount Pictures
                (1996.0, 2006.0]                            Warner Bros.
                (2006.0, 2016.0]                    Walt Disney Pictures

#### 12. In each year, how many movies have revenue smaller than the budget?

In [38]:
film_in_perdita=overall[overall["revenue"]<
                        overall["budget"]][['movie_id','anno_uscita']].groupby('anno_uscita').count()
film_in_perdita.columns=["Film_in_perdita"]
film_in_perdita.tail(5)

             Film_in_perdita
anno_uscita
2,012.00                  52
2,013.00                  62
2,014.00                  59
2,015.00                  67
2,016.00                  26